# 1. Напишите программу, которая принимает на вход число N и выдаёт последовательность из N членов.
# n = int(input("Введите число N: "))
# x = 1;
# for i in range(1, n + 1):
#     print(x, end=" ")
#     x *= -3
# 2. Для натурального n создать словарь индекс-значение, состоящий из элементов последовательности 3n + 1.
# dict = {i: 3 * i + 1 for i in range(1, int(input()) + 1)}
# print(dict)
# 3. Напишите программу, в которой пользователь будет задавать две строки, а программа - определять количество вхождений одной строки в другой.
# str1 = input("Введите первую строку ")
# str2 = input("Введите вторую строку ")
# str1 = str1.split()
# count = 0
# for i in str1:
#     if i == str2:
#         count += 1
# print(count)
